<img src="https://user-images.githubusercontent.com/110621233/231062359-1b7d42fd-45a2-4605-8034-c342d05d5a9d.png"></img>
><!DOCTYPE html>
<html lang="en">
<head>
</head>
<body>
  <h1>Closure (클로저)</h1>
  <p>
    클로저(Closure)는 자바스크립트의 중요한 개념 중 하나로, 함수와 그 함수가 선언된 렉시컬 환경의 조합이다. <br>
    클로저는 함수가 생성될 때 해당 함수의 렉시컬 환경을 기억하고, 이 렉시컬 환경을 함수가 실행될 때 접근할 수 있게 해준다.
  </p>
  
  <h2>렉시컬 환경(Lexical Environment)</h2>
  <ul>
    <li>자바스크립트에서 변수, 함수, 스코프 등을 관리하는 내부 데이터 구조이다.</li>
    <li>렉시컬 환경은 변수와 함수를 식별하고 저장하며, 스코프 체인을 구성하여 변수에 접근할 수 있는 범위를 결정한다.</li>
    <li>렉시컬 환경은 크게 두 가지 컴포넌트로 구성된다</li>
    <ol>
      <h3><li>환경 레코드(Environment Record)</li></h3>
      <ul>
        <li>환경 레코드는 변수 식별자와 그에 해당하는 값, 함수 등을 기록하는 데이터 구조이다.</li>
        <li>변수, 함수 선언 등의 정보를 저장하고 관리한다.</li>
      </ul> 
      <h3><li>외부 렉시컬 환경 참조(Outer Lexical Environment Reference)</li></h3>
      <ul>
        <li>외부 렉시컬 환경 참조는 현재 렉시컬 환경과 관련된 외부 스코프(상위 스코프)를 가리키는 참조이다.</li>
        <li>이를 통해 스코프 체인을 형성하고 변수를 검색하는 데 사용된다.</li>
      </ul>
    </ol>
  </ul>
    
  <h2>클로저의 특징</h2>
  <ul>
    <li>외부 함수와 내부 함수의 조합: 클로저는 외부 함수 내부에서 내부 함수를 정의하고 반환함으로써 생성된다.</li>
    <li>렉시컬 스코프 기반: 클로저는 함수가 정의된 위치에 따라 해당 함수가 접근할 수 있는 변수를 결정한다. 이는 렉시컬 스코프의 원리를 따른다.</li>
    <li>외부 변수 접근: 클로저는 자신이 생성될 때의 외부 함수의 변수에 접근할 수 있다. 이는 외부 함수의 변수를 "기억"하고 있기 때문에 가능한 동작이다.</li>
  </ul>

  <h2>클로저의 활용</h2>
  <p>
    클로저는 다양한 상황에서 활용될 수 있다. 다음은 몇 가지 예시이다.
  </p>
  
  <h3>예시 1: 은닉화(Encapsulation)</h3>
  <p>
    클로저를 사용하면 프라이빗(private) 변수와 함수를 구현하여 정보 은닉화를 할 수 있다. <br>
    아래의 예시 코드는 카운터 함수를 생성하고 클로저를 사용하여 카운터 값을 보호하는 방법을 보여준다.
  </p>
  <img src="https://github.com/Jinga02/Review/assets/110621233/17a93ab8-ceef-4beb-acf2-7d4c22d1ff72" alt="은닉화">
  
  <h3>예시 2: 반복문과 비동기 작업</h3>
  <p>
    클로저는 반복문과 비동기 작업에서도 유용하게 활용될 수 있다. <br>
    아래의 예시 코드는 반복문과 setTimeout 함수를 조합하여 일정 시간 간격으로 값을 출력하는 방법을 보여준다.
  </p>
  <img src="https://github.com/Jinga02/Review/assets/110621233/c1cf37a0-7f02-4fa9-bc89-ccd927c86511" alt="반복문과 비동기 작업">  
  <h3>예시 3: 함수 팩토리(Function Factory)</h3>
  <p>
    클로저를 활용하여 함수를 동적으로 생성하는 함수 팩토리 패턴도 많이 사용된다. <br>
    아래의 예시 코드는 원하는 사칙 연산을 수행하는 함수를 동적으로 생성하는 함수 팩토리를 구현한 것이다다.
  </p>
  <img src="https://github.com/Jinga02/Review/assets/110621233/b0e57827-594a-4965-9881-a45c94606df1" alt="함수 팩토리">
  
  <p>
    이처럼 클로저는 자바스크립트에서 다양한 상황에서 활용될 수 있다.
    함수와 그 함수가 생성된 렉시컬 환경의 조합으로서, 클로저는 유연하고 강력한 기능을 제공한다.
  </p>
<img src="https://user-images.githubusercontent.com/110621233/231062359-1b7d42fd-45a2-4605-8034-c342d05d5a9d.png"></img>

</body>
</html>